<template>
    <div>
        <h3>第六天</h3>
        <h4>内容</h4>
        <pre>
            服务端渲染
            SSR原理
            将同一个组件渲染为服务器端的HTML字符串。将他们直接发送到浏览器，最后将这些
            静态标记“激活”为客户端上完全可交互的应用程序。
            应用场景：
            1、应用需要更好的SEO
            2、应用需要更快的内容到达时间（首屏渲染时间），特别是对于缓慢的网络情况
            或运行缓慢的设备。
            ssr的局限
            1、更大的服务器负载
            2、较高的学习成本
            3、一些外部扩展库使用受限

        ————————————————————————————
        nuxt安装
        npm create-nuxt-app 《项目名》
        
        </pre>
    </div>
</template>
